// Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве.
// [345, 897, 568, 234] -> 2
// Console.WriteLine("Введите размер массива");
// int size = Convert.ToInt32(Console.ReadLine());
// int [] array = new int [size];
// int count = 0;
// for (int i = 0; i < array.Length; i++)
// {
//     array[i] = new Random().Next(100,999);
// }
// printArray(array);
// void printArray(int[] array)
// {
//     Console.Write($"[{array[0]}");
//     for (int i = 1; i < array.Length; i++)
//         Console.Write($", {array[i]}");
//     Console.WriteLine($"]");
// }
//for (int i = 0; i < array.Length; i++)
//{
//  if (array[i] % 2 == 0)
//    {
//       count = count + 1;
//    }
//}   
//Console.WriteLine(count);   